2_5M/0deg_4Kenjeres/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField uniform 270.2;

boundaryField
{
    inlet
    {
        type          fixedValue;
        value  $internalField;
    }

    outlet
    {
        type          fixedValue;
        value  $internalField;
    }

    airfoil
    {
        type          fixedValue;
        value         uniform 300;
        
        // fixedGradient
        // type     fixedGradient;
        // gradient uniform 350;
        
    }

    defaultPatches
    {
        type            empty;
    }
}

// ************************************************************************* //
